; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	image0 - mode
	infrared1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star4 - direction
	Star5 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
)
(:goal (and
	(pointing satellite2 Planet11)
	(have_image Planet8 image0)
	(have_image Planet9 image0)
	(have_image Star10 image0)
	(have_image Planet11 image0)
	(have_image Star12 infrared1)
	(have_image Planet13 image0)
	(have_image Star14 infrared1)
	(have_image Phenomenon15 image0)
	(have_image Star16 infrared1)
	(have_image Star17 image0)
	(have_image Planet18 infrared1)
))

)

; plan
1. (turn_to satellite2 star5 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star5)
   goals met: 0 of 12
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite2 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite2 planet9 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet9)
   goals met: 0 of 12
5. (take_image satellite2 planet9 instrument3 image0)
   added: (have_image planet9 image0)
   goals met: 1 of 12
6. (turn_to satellite2 planet8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet8)
   goals met: 1 of 12
7. (take_image satellite2 planet8 instrument3 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 12
8. (turn_to satellite2 planet18 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet18)
   goals met: 2 of 12
9. (take_image satellite2 planet18 instrument3 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 3 of 12
10. (turn_to satellite2 planet13 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet13)
   goals met: 3 of 12
11. (take_image satellite2 planet13 instrument3 image0)
   added: (have_image planet13 image0)
   goals met: 4 of 12
12. (turn_to satellite2 phenomenon15 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon15)
   goals met: 4 of 12
13. (take_image satellite2 phenomenon15 instrument3 image0)
   added: (have_image phenomenon15 image0)
   goals met: 5 of 12
14. (turn_to satellite2 star10 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 star10)
   goals met: 5 of 12
15. (take_image satellite2 star10 instrument3 image0)
   added: (have_image star10 image0)
   goals met: 6 of 12
16. (turn_to satellite2 star12 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star12)
   goals met: 6 of 12
17. (take_image satellite2 star12 instrument3 infrared1)
   added: (have_image star12 infrared1)
   goals met: 7 of 12
18. (turn_to satellite2 star14 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star14)
   goals met: 7 of 12
19. (take_image satellite2 star14 instrument3 infrared1)
   added: (have_image star14 infrared1)
   goals met: 8 of 12
20. (turn_to satellite2 star16 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star16)
   goals met: 8 of 12
21. (take_image satellite2 star16 instrument3 infrared1)
   added: (have_image star16 infrared1)
   goals met: 9 of 12
22. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 9 of 12
23. (take_image satellite2 star17 instrument3 image0)
   added: (have_image star17 image0)
   goals met: 10 of 12
24. (turn_to satellite2 planet11 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 planet11)
   goals met: 11 of 12
25. (take_image satellite2 planet11 instrument3 image0)
   added: (have_image planet11 image0)
   goals met: 12 of 12
